---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusStrongAxis
source: html/31a1f174-8174-5010-09e4-04d73db10028.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusStrongAxis Property

Elastic section modulus about main strong axis for calculation of bending stresses.

## Syntax (C#)
```csharp
public double ElasticModulusStrongAxis { get; set; }
```